var url = location.href;

if (url == "https://tozaburo.github.io/aboutme/history") {
  var mode = "easy";
} else {
  var mode = url.replace("https://tozaburo.github.io/aboutme/history?", "");
}

if (mode == "hard") {
  var year = [
    "645",
    "723",
    "743",
    "1185",
    "1428",
    "1485",
    "1488",
    "1582",
    "1588",
    "1782",
    "1872",
    "1872",
    "1873",
    "1894",
    "1895",
    "1895",
    "1901",
    "1902",
    "1904",
    "1905",
    "1910",
    "1911",
    "1912",
    "1914",
    "1915",
    "1916",
    "1918",
    "1918",
    "1919",
    "1922",
    "1923",
    "1924",
    "1925",
    "1925",
    "1925",
    "1929",
    "1931",
    "1932",
    "1932",
    "1933",
    "1936",
    "1937",
    "1938",
    "1939",
    "1940",
    "1941",
    "1945",
    "1945",
    "1945",
    "1945",
    "1945",
    "1945",
    "1945",
    "1946",
    "1947",
    "1950",
    "1951",
    "1951",
    "1953",
    "1954",
    "1955",
    "1956",
    "1964",
    "1964",
    "1965",
    "1967",
    "1967",
    "1972",
    "1972",
    "1973",
    "1978",
    "1988",
    "1988",
    "1989",
    "1989",
    "1991",
    "1991",
    "1992",
    "1993",
    "1995",
    "1995",
    "1997",
    "2005",
    "2011",
    "2019"
  ];
  var event = [
    "中大兄皇子と中臣鎌足が大化の改新を行う",
    "三世一身の法が出される",
    "墾田永年私財法が出される",
    "荘園に地頭が置かれる",
    "正長の土一揆が起こる",
    "山城の国一揆が起こる",
    "加賀の一向一揆が起こる",
    "豊臣秀吉が太閤検地を行う",
    "豊臣秀吉が刀狩令を出す",
    "天明の飢饉が起こる",
    "鉄道が開通する",
    "富岡製糸場の操業が始まる",
    "地租改正条例が出される",
    "日清戦争が始まる",
    "下関条約が結ばれる",
    "三国干渉が起こる",
    "八幡製鉄所の操業が始まる",
    "日英同盟が結ばれる",
    "日露戦争が始まる",
    "ポーツマス条約が結ばれる",
    "韓国併合を行う",
    "平塚雷鳥らが青踏社を結成する",
    "第一次護憲運動が起こる",
    "第一次世界大戦が始まる",
    "中国に対し二十一か条の要求が出される",
    "吉野作造が民本主義の考えを発表する",
    "原敬内閣が成立する",
    "米騒動が起こる",
    "ベルサイユ条約が結ばれる",
    "全国水平社が結成する",
    "関東大震災が起こる",
    "第二次護憲運動が起こる",
    "治安維持法が制定される",
    "普通選挙法が制定される",
    "ラジオ放送が始まる",
    "世界恐慌が起こる",
    "満州事変が起こる",
    "満州国が建国される",
    "五・一五事件が起こる",
    "国際連盟の脱退を通告する",
    "二・二六事件が起こる",
    "日中戦争が始まる",
    "国家総動員法が制定される",
    "第二次世界大戦が始まる",
    "日独伊三国同盟が結ばれる",
    "太平洋戦争が始まる",
    "沖縄にアメリカ軍が上陸する",
    "広島（8月9日）・長崎（9日）に原子爆弾が投下される",
    "ポツダム宣言を受諾する（8月14日）",
    "連合国軍に占領される",
    "婦人参政権が認められる",
    "農地改革が始まる",
    "財閥解体が行われる",
    "日本国憲法が公布される（11月3日）",
    "日本国憲法が施行される（5月3日）",
    "朝鮮戦争が始まる",
    "サンフランシスコ平和条約が結ばれる（日本の独立回復）",
    "日米安全保障条約が結ばれる",
    "テレビ放送が始まる",
    "第五福竜丸事件が起こる",
    "第一回原水爆禁止世界大会が開かれる",
    "日ソ共同宣言が結ばれる（国際連盟への加盟）",
    "「夢の超特急」東海道新幹線が開通する",
    "東京オリンピックが開催される",
    "日韓基本条約が結ばれる",
    "公害対策基本法が制定される",
    "佐藤栄作総理大臣が非核三原則を発表する",
    "沖縄が日本に復帰する",
    "日中共同声明が結ばれる",
    "第一次石油危機が起こる",
    "日中平和友好条約が結ばれる",
    "瀬戸大橋が開通する",
    "青函トンネルが開通する",
    "消費税が導入される",
    "マルタ会談が開かれる",
    "牛肉・オレンジの輸入が自由化される",
    "バブル経済が崩壊する",
    "PKO協力法が成立する",
    "環境基本法が制定される",
    "阪神・淡路大震災が起こる",
    "米の輸入が部分開放される",
    "北陸新幹線が開通する",
    "中部国際空港が開港する",
    "東日本大震災が起こる",
    "天皇が退位→新元号「令和」が開始"
  ];
} else {
  var year = [
    "645",
    "1582",
    "1873",
    "1894",
    "1904",
    "1910",
    "1925",
    "1931",
    "1941",
    "1945",
    "1945",
    "1945",
    "1945",
    "1945",
    "1946",
    "1947",
    "1951",
    "1972",
    "1973"
  ];
  var event = [
    "中大兄皇子と中臣鎌足が大化の改新を行う",
    "豊臣秀吉が太閤検地を行う",
    "地租改正条例が出される",
    "日清戦争が始まる",
    "日露戦争が始まる",
    "韓国併合を行う",
    "治安維持法が制定される",
    "満州事変が起こる",
    "太平洋戦争が始まる",
    "沖縄にアメリカ軍が上陸する",
    "広島（8月9日）・長崎（9日）に原子爆弾が投下される",
    "ポツダム宣言を受諾する（8月14日）",
    "連合国軍に占領される",
    "婦人参政権が認められる",
    "日本国憲法が公布される（11月3日）",
    "日本国憲法が施行される（5月3日）",
    "サンフランシスコ平和条約が結ばれる（日本の独立回復）",
    "沖縄が日本に復帰する",
    "第一次石油危機が起こる"
  ];

  var hint = [
    "虫殺し",
    "以後、ハニー",
    "岩、NASA",
    "いや、櫛！？",
    "行く？マヨ",
    "行く？硫黄",
    "行く？2個？",
    "戦、い（やだ）",
    "行く用意",
    "行く、死後",
    "行く、死後",
    "行く、死後",
    "行く、死後",
    "行く、死後",
    "行く、読む",
    "行く、椎名",
    "行く、来い",
    "行く、何？",
    "行く、NASA"
  ];
}

var yanswer = "";
var hadHint = 0;
var pnum = 0;
var answer = "0000";

function random(min, max) {
  return Math.floor(Math.random() * (max - min) + min);
}

function newQuiz() {
  hadHint = 0;
  pnum = random(0, year.length);
  answer = year[pnum];
  document.getElementById("question").textContent = event[pnum];
}

function check() {
  yanswer = document.getElementById("answer").value;
  if (yanswer == answer) {
    correct();
  } else {
    wrong();
  }
}

function correct() {
  if (hadHint == 0) {
    event.splice(year.indexOf(yanswer), 1);
    hint.splice(year.indexOf(yanswer), 1);
    year.splice(year.indexOf(yanswer), 1);
  }
  document.getElementById("answer").value = "";
  audio("correct");
  confetti();
  newQuiz();
}

function wrong() {
  audio("wrong");
}

function fhint() {
  alert(hint[pnum]);
  hadHint = 1;
}

function audio(file) {
  document.getElementById(file).currentTime = 0;
  document.getElementById(file).play();
}
